{
    "callForPapers": {
        "deadline": "2017-11-14",
        "notification": "2017-11-15",
        "url": "https://goo.gl/forms/IgmgmCFtwSzvtfaq2"
    },
    "city": "Porto Alegre",
    "date": "2017-12-09",
    "enrollment": {
        "availability": 300,
        "closed": true,
        "deadline": "2017-12-08",
        "start": "2017-11-15",
        "url": ""
    },
    "id": "poa",
    "institution": {
        "address": "R. Col. Genuíno, 130",
        "latitude": -30.035237,
        "logo": "senac.png",
        "long_name": "Faculdade Senac Porto Alegre",
        "longitude": -51.226635,
        "short_name": "FSPOA",
        "url": "http://senacrs.com.br/unidades.asp?unidade=63"
    },
    "result": {},
    "rooms": [
        {
            "number": "1",
            "subject": "DevOps"
        },
        {
            "number": "2",
            "subject": "SysAdmin, Cloud e BigData"
        },
        {
            "number": "3",
            "subject": "Web e Segurança"
        },
        {
            "number": "4",
            "subject": "Linguagens de Programação"
        },
        {
            "number": "5",
            "subject": "Empreendedorismo e Comunidade"
        },
        {
            "number": "6",
            "subject": "Distros, Aplicações e IoT"
        }
    ],
    "schedule": {
        "08:30": [
            {
                "abstract": "",
                "author": "",
                "keywords": "credenciamento",
                "level": "",
                "resume": "",
                "room": "",
                "title": "Credenciamento"
            }
        ],
        "09:00": [
            {
                "abstract": "",
                "author": "Rafael Jeffman",
                "keywords": "abertura",
                "level": "",
                "resume": "",
                "room": "",
                "title": "Abertura"
            }
        ],
        "09:30": [
            {
                "abstract": "Tu já viste que tem uma galera falando de DevOps ultimamente? Mas será que todos que falam vivem realmente essa cultura? Vou te falar sobre 10 motivos que são verdadeiros indicadores de que talvez poucos vivenciam DevOps completamente. Vamos relembrar os pilares, as práticas e os aspectos do DevOps que são largamente citados na literatura e foram consolidados pela comunidade.",
                "author": "Daiane Azevedo de Fraga",
                "keywords": "devops,infraestrutura-ágil,processo-desenvolvimento-ágil",
                "level": "Intermediário",
                "resume": "Graduada em Engenharia de Computação pela PUCRS, atua com desenvolvimento de software e automação de testes desde 2007. Em 2011 começou a atuar com desenvolvimento de frameworks para testes automatizados de protocolos de redes em uma empresa do setor de Telecomunicações, posteriormente na mesma empresa, passou a trabalhar com infraestrutura ágil, desenho dos processos de desenvolvimento e disseminação da cultura DevOps. Em 2016, passou a atuar com foco em automação de testes para sistemas financeiros de uma empresa de varejo de grande porte. Atualmente, atua como desenvolvedora de software na Umbler, participando dos processos relacionados à qualidade de software.",
                "room": "1",
                "title": "10 motivos que indicam que tu não vivencias DevOps"
            },
            {
                "abstract": "Soluções de Open Source para uma rede de computadores para pequenas empresas",
                "author": "Luis Carlos Peters Motta",
                "keywords": "Infraestrutura, Redes, OpenSource",
                "level": "Principiante",
                "resume": "Cursei Análise e Desenvolvimento de Sistemas, bacharelado em Ciencias Sociais,para entender como a tecnologia impacta em nossa vida diária, tenho MBA em gestão de TI pelo IGTI. Além destes tenho vários cursos em diversas áreas tecnologicas, tais como:Administração Avançada do Sistema Operacional LINUX. Segurança das Informações em Rede. Administração em Redes e muitos outros. Sou um dos tradutores da distribuição LINUX FEDORA, sendo um dos mais ativos no mundo. Espírita, musico amador, autodidata sempre.  Inquieto, sempre busco mais o conhecimento a fim de transformá-lo em inteligencia e principalmente colaborar no crescimento de organizações e pessoas, potencializando tudo aquilo que estes tem de melhor.",
                "room": "2",
                "title": "Infraestrutura de rede básica com Software Livre"
            },
            {
                "abstract": "Refatorando código e tirando a sujeira de debaixo do tapete ",
                "author": "Sidney Souza",
                "keywords": "PHP, refactoring, legado",
                "level": "Intermediário",
                "resume": "Analista de Sistema formado pela faculdade FTEC. Trabalho com software livre desde 2008 quando iniciei minha carreira como instrutor de telecentro e desde então o Linux nunca mais saiu da minha vida. Atualmente sou programador na empresa OpServices IT onde tive oportunidade de contribuir com projetos como nagios-plugins e desenvolver outros agentes para as mais diversas finalidades",
                "room": "3",
                "title": "Object Calisthenics em PHP - Só a prática leva a perfeição"
            },
            {
                "abstract": "Tendo como pilares performance, segurança e concorrência, Rust é uma linguagem muito estável. Por dar acesso de baixo nível para desenvolvimento de sistemas, trazer abstrações de alto nível e ser multiparadigma, Rust tem atraído cada vez mais programadores. Existem diversos pacotes para ela, que a fazem ter um largo leque de aplicações, como motores de jogos e web, sistemas operacionais e bancos de dados. Nesta palestra a sintaxe será apresentada e serão mostrados os principais recursos da linguagem.",
                "author": "Cássio Kirch",
                "keywords": "Rust, linguagens de programação, desenvolvimento de sistemas",
                "level": "Principiante",
                "resume": "Graduando em Engenharia Física pela UFRGS; desenvolvedor C, C++, Python e Rust, usando bibliotecas de concorrência e paralelização, e iniciante em pesquisa na área de biofísica desde 2015, escrevendo e rodando simulações e analisando dados. Administrador de servidores GNU/Linux no Instituto de Física/UFRGS em 2013 e 2014. Brinca com LaTeX, Emacs, BashScript, HTML, Java e C#.",
                "room": "4",
                "title": "Introdução à linguagem Rust"
            },
            {
                "abstract": "Ter meios de melhorar a educação das pessoas com deficiência tem sido uma grande barreira ao ensino. Oferecer o S.L.E. como solução abrangendo as diversas áreas do saber pode e deve ser o meio pela qual podemos melhorar esta situação. Procurar oferecer o melhor no que diz respeito a didática inclusiva no âmbito educacional e, desta forma proporcionar uma alternativa no desenvolvimento da aprendizagem da pessoa com deficiência, além de servir como ferramenta de auxílio para o professor. Como objetivo principal mostrar que o software livre tem a capacidade de ser utilizado como meio de apoio ao ensino, levando em conta seu aprendizado e, que ele possa utilizá-lo habilmente. ",
                "author": "Marcos Silva Vieira",
                "keywords": "Educação; Software Livre; Deficientes",
                "level": "Principiante",
                "resume": "Professor desde 1986. Formação acadêmica em pedagogia pela Universidade Luterana do Brasil - Polo Sul . Trabalhei em laboratórios de informática em ambientes escolares. Coordenação de grupos de trabalhos em educação inclusiva com uso de novas tecnologias na educação. Efetuei atividades de profissionalização de pessoas com deficiência (PCD).  Participo de comunidades Linux voltadas a educação e educação inclusiva, como Linux Educacional, Pandorga GNU/Linux dentre outras. Palestrante e ministrante de cursos de formação em Software Livre Educacional Inclusivo desde 2009. Participante e palestrante de eventos como Latinoware (Foz do Iguaçu), Forum Internacional de Software Livre (Porto Alegre), Freedom Day (Novo Hamburgo), Congresso Alagoano de Tecnologia de Informação (edições em Alagoas e Pernambuco) SEMED Maceió (AL), SMED Alvorada (RS).",
                "room": "5",
                "title": "O Ensino e Pessoas com Deficiencia - Com Software Livre é Possível"
            },
            {
                "abstract": "Nesta palestra serão abordados aspectos referentes a história da criação do Movimento Software Livre, a importância do uso de Softwares Livres ao invés de softwares privativos, legislações referentes ao uso de Softwares Livres no RS e exemplos de algumas distribuições GNU/Linux. ",
                "author": "Clayton Eduardo Dausacker",
                "keywords": "Software Livre, Movimento, Legislações",
                "level": "Principiante",
                "resume": "Assistente Social, Usuário GNU, Ativista do Movimento Software Livre, Sócio da ASL (Associação Software Livre.Org), Palestrante na Formação para Professores 2014 (E. E. E. M. Campos Verdes - Alvorada), Palestrante Software Freedom Day 2014, 2015 e 2016 (Feevale - Novo Hamburgo), Palestrante FLISOL 2015 e 2016 (Feevale - Novo Hamburgo), Palestrante Fórum Tchelinux 2014 (FTEC - Caxias do Sul), Palestrante Fórum Tchelinux 2015 (FTEC - Novo Hamburgo), Palestrante FISL16 e FISL17 (PUC - Porto Alegre), Palestrante Painel Software Livre 2015 (ULBRA - Gravataí) ",
                "room": "6",
                "title": "Software Livre: Socialmente Justo, Economicamente Viável e Tecnologicamente Sustentável"
            }
        ],
        "10:30": [
            {
                "abstract": "Nessa palestra gostaria de explorar o uso de golang para criar scripts e programas úteis no servidor. Gostaria também de explorar algumas boas práticas de desenvolvimento, como testes, a fim de tentar apresentar uma boa estratégia de gerar programas testáveis e distribuíveis. Minha motivação para essa apresentação é a complicação de algumas linguagens de script tem para gestão de dependências.",
                "author": "Sebastian Webber",
                "keywords": "golang, server, script, deployment,dependency-nightmares",
                "level": "Intermediário",
                "resume": "Trabalho como consultor, apoiando equipes de infraestrutura e desenvolvimento a encontrar soluções para demandas de TI, através da na nuvem da AWS, intra-estrutura como código e também sobre banco de dados, utilizando PostgreSQL.",
                "room": "1",
                "title": "GoLang para DEVOPS"
            },
            {
                "abstract": "Para que serve o nagios, onde se aplica, como monitorar e gerenciar em real time seus ativos, produtos e ambiente.",
                "author": "Joao Vieira",
                "keywords": "Monitoria, Plugins, Perl",
                "level": "Intermediário",
                "resume": "Formado em Gestão de TI, pela Uniasselvi, Tecnólogo em redes e técnico em Informática. MCSA + Communications Microsoft, trabalho a mais de 14 anos com Infraestrutura, atualmente Analista de Infraestrutura Pleno da Neogrid.",
                "room": "2",
                "title": "Nagios - Seu ambiente está monitorado ?"
            },
            {
                "abstract": "O Ionic é um dos Frameworks mais usados atualmente no mundo para desenvolvimento de aplicativos e soluções mobile, uma ferramenta que está cada vez mais estável, confiável e ágil. O objetivo principal  deste encontro é mostrar a facilidade com que se pode desenvolver um aplicativo mobile de forma simples e rápida. A ideia é fazer um hands on, desenvolver o código em realtime aos olhos de todos, buscando demonstrar como esta ferramenta é utilizada para desenvolver um aplicativo em um curto prazo de tempo. Para isso, abordaremos um pouco a documentação do Ionic e faremos uso de requisições Http via provider, um armazenamento local storage para salvar a localidade, conhecer e acessar a openweathermap. Em resumo é uma ótima introdução para quem quiser conhecer e começar a desenvolver aplicativos para smartphones usando Ionic Framework.",
                "author": "Everton (Tom) Costa",
                "keywords": "Ionic, Mobile, Aplicativo, Rápido",
                "level": "Principiante",
                "resume": "Microempreendedor individual, desenvolvedor mobile há dois anos. Formado em Análise e Desenvolvimento de Sistemas pela Uniftec, fez intercâmbio na Hungria. Participa do grupo Rede Neural na Serra Gaúcha, é atuante e colaborador na comunidade do Ionic.",
                "room": "3",
                "title": "Ionic 3, do zero a um aplicativo de Clima em 30min com openweathermap.org"
            },
            {
                "abstract": "Vou contar sobre meu quase hobby de programar jogos de computador (usando a biblioteca pygame), com o diferencial de que o jogo consiste em programar o próprio jogo, indo além de jogá-lo.",
                "author": "Adriano Rafael Gomes",
                "keywords": "pygame,jogos,programação,hobby",
                "level": "Principiante",
                "resume": "Bacharel em Ciência da Computação, profissional da área de TI há mais de 20 anos e membro da comunidade de Software Livre desde 2003.",
                "room": "4",
                "title": "Quando programar é o jogo"
            },
            {
                "abstract": "Vou indicar um roteiro para além de usar, se poder criar, compartilhar e contribuir com ecossistemas de educação (da escola à univerdade) e profissional (do empregado, profissional, à startup) podendo assim serem usados de forma prática e aprimorando-se ao seus conhecimentos e upando skills. Digo isso pq já fui, sou e continuarei sendo aluno e professor, além de participar de inúmeros eventos, e assim, já ví muitas coisas boas relacionadas a estas palavras do título e gosto de compartilhar, uma contribuição ao muito que já aprendi.",
                "author": "Luiz Henrique Rauber Rodrigues",
                "keywords": "sofware livre, educação, negócios",
                "level": "Intermediário",
                "resume": "Professor e Pesquisador. Atualmente leciona programação Web/ Desktop/ Mobile no Senac Santa Cruz do Sul e cursa o Doutorado em Tecnologia Ambiental da UNISC com tese focada em TI Verde e Análise do Ciclo de Vida. Fez mestrado em Nanociências pela UNIFRA, especialização em Gerenciamento de Projetos pela PUCRS e bacharelado em Ciência da Computação e Técnico em Informática pela URI Santiago. Foi mentor de Startup Weekend e palestrante de Campus Party, Latinoware, FISL e outros. Voluntário do CodeClubBrasil.org, JabutiEdu.org e Tchelinux.org.",
                "room": "5",
                "title": "Software Livre, da Educação ao Profissional"
            },
            {
                "abstract": "A partir da experiência de uma aluna surda no curso técnico em informática teve-se a ideia de construir o website que é uma plataforma de gestão do conhecimento que apresenta de forma categorizada vídeos próprios de palavras da TI interpretados de forma datilológica e também em sinais em Libras, contribuindo ainda para o aprendizado do surdo e falante no site, há uma explicação técnica de cada termo interpretado. Na palestra será demostrado as tecnologias utilizadas e experiências sobre os eventos onde foi demostrando, em especial na Feira de Projetos do SENAC-RS onde foi premiado.",
                "author": "Angelo Pinheiro, Letícia Bauermann, Tcharles Schultz e William Ellwanger",
                "keywords": "Inclusão, Wordpress, LIBRAS",
                "level": "Principiante",
                "resume": "Alunos do curso Técnico em Informática do Senac Santa Cruz do Sul",
                "room": "6",
                "title": "TIemLIBRAS.com, um case de trabalho em aula para promover inclusão"
            }
        ],
        "11:30": [
            {
                "abstract": "",
                "author": "",
                "keywords": "intervalo",
                "level": "",
                "resume": "",
                "room": "",
                "title": "Intervalo de Almoço"
            }
        ],
        "13:00": [
            {
                "abstract": "Docker é uma das tecnologias do momento, mas você sabe o que é? Onde utilizá-lo? Quais problemas ele resolve? O objetivo dessa apresentação é responder essas questões e mostrar porque todo mundo só fala dele.",
                "author": "Cristiano dos Santos Diedrich",
                "keywords": "Docker, Docker para desenvolvedores, DevOps",
                "level": "Principiante",
                "resume": "Formado em sistemas de informação, trabalho atualmente como container specialyst na Umbler, uma startup de hosting sob demanda, atuo na pesquisa e desenvolvimento de soluções para hosting e PaaS. Sou apaixonado por linux e tecnologias open-source, áreas que conheço a mais de 12 anos.",
                "room": "1",
                "title": "Docker para iniciantes"
            },
            {
                "abstract": "Os S.O. de Compartimentalização tem a pretensão de ser a nova maneira de de garantir a privacidade na web, possui micro kernel ou kernel monolítico, alguns são baseados em Linux outros em Xen. São uma resposta a atual hipervigilância. A palestra abordará o Qubes OS e o Subgraph OS.",
                "author": "Ayr Müller Gonçalves",
                "keywords": "Sistema Operacionais, Compartimentalização, Virtualização de Hardware, Hipervigilância",
                "level": "Intermediário",
                "resume": "Graduando de Segurança da Informação UNISINOS, pesquisador independente de criptografia e controle de acesso. ",
                "room": "2",
                "title": "Sistemas Operacionais de Compartimentalização"
            },
            {
                "abstract": "Uma apresentação sobre o WebVR — Realidade Virtual para a Web! Com foco no framework A-Frame, que facilita a criação e interação de componentes e assim possibilitando a construção de um mundo de realidade virtual para seu navegador.",
                "author": "Jaime Maretoli",
                "keywords": "WebVR, A-Frame, Mozilla",
                "level": "Principiante",
                "resume": "Jaime é o menino do computador. Atua como desenvolvedor de software, instrutor de TI, webwriter e sempre que pode, está dentro de eventos. A cada dia ajuda a salvar o mundo através da tecnologia, é voluntário da comunidade Mozilla Brasil e mestre na área do ctrl + c e ctrl + v. OBS: não arruma impressora e não “hackeia” Facebook. Mais informações em: http://linkedin.com/in/jaimemaretoli/",
                "room": "3",
                "title": "A-Frame: A Realidade Virtual para a web!"
            },
            {
                "abstract": "O que é uma arquitetura de micro serviços, como usar Python para criar um serviço, como criar APIs com o framework Tornado e como o Tornado trabalha com um processo principal sem thread mas com requisições simultâneas. Integrações com Redis RabbiMQ com celery.",
                "author": "Joelmir Ribacki",
                "keywords": "python, tornado, celery, redis, rabbitmq, microservicos",
                "level": "Intermediário",
                "resume": "Desenvolvedor a 7 anos e a 4 anos desenvolvendo com Python, atualmente trabalhando com projetos de IoT na empresa DevGrid. Utilizando nos projetos Python3 e módulos relacionados a Machine Learning em uma arquitetura de micro serviços.",
                "room": "4",
                "title": "Micro serviços com Python3, Tornado e Integrações"
            },
            {
                "abstract": "Após muitos anos trabalhando com freelancer para conquistar independência financeira, fui aprendendo como tornar meu trabalho mais dinâmico e eficiente. Infelizmente, o freela para muitos profissionais se torna mais um prego no sapato do que algo que realmente vai acrescentar conhecimento (além de, claro, dinheiro). O que fazer para ter bons ganhos de skill com um freela? E como fica a questão homeoffice? Como trabalhar de forma produtiva durante o seu tempo disponível? Depois de tanto aperto, descobri atalho (ou vários) dentro do caminho das pedras.",
                "author": "Camilla Martins",
                "keywords": "freelancer, homeoffice, TI, skills, independência, produtividade",
                "level": "Principiante",
                "resume": "Camilla Martins. Mas pode chamar de Cami. Sou paulista, tenho 20 anos e sigo como aspirante a programadora desde os 11/12 anos, me aventurando com trabalhos front-end para manter um blog onde procuro ajudar a comunidade e também conseguir uma grana extra com trabalhos freela. As coisas começaram a ficar mais sérias e, eu, mais empenhada. Daí, comecei a trabalhar e estudar profundamente programação, me formando recentemente como Analista de Sistemas. Atualmente trabalho como Software Engineer na Umbler, auxiliando não apenas nos projetos como full-stack mas no crescimento social e profissional da empresa, divulgando-a e já tendo ministrado palestra internamente.",
                "room": "5",
                "title": "Tornando seus freelas e homeoffice mais produtivos"
            },
            {
                "abstract": "Produção e edição de vídeos com softwares nativos GNU/Linux. Serão abordadas várias etapas de edição e produção, começando com cortes e montagem, passando por tratamento de áudio, correção de cor, composição de cena e finalização. ",
                "author": "Régis Tomkiel",
                "keywords": "Edição de vídeo, edição de audio, videomaker",
                "level": "Principiante",
                "resume": "Formando em Sistemas de informação, produtor audiovisual com foco em utilização de ferramentas nas plataformas GNU/Linux, roteirista, podcaster e cofundador da produtora e agência Dose Extra Multimídia. Entusiasta de Software Livre desde 2006, quando conheceu o Slackware. Atualmente desenvolve praticamente todos os trabalhos de produção de vídeo nativamente numa distro GNU/Linux e com softwares renomados no mercado.",
                "room": "6",
                "title": "Linux para filmmakers"
            }
        ],
        "14:00": [
            {
                "abstract": "Juntamente com os diversos avanços trazidos pela utilização de containers, novos desafios foram inseridos, um dos principais sendo a orquestração de containers. O Kubernetes nasceu como solução para esse desafio e vem, a cada dia mais, sendo adotado pelos mais variados times, nas suas mais variadas necessidades de negócio. Nessa palestra será apresentado o funcionamento interno do Kubernetes, trazendo cada um de seus módulos e explicando qual problema ele resolve. A medida que cada módulo for apresentado, será demonstrado como implantá-lo, tendo ao final da apresentação um novo cluster Kubernetes rodando e pronto para receber novos containers.",
                "author": "Fernando Ruaro",
                "keywords": "Kubernetes Orquestração Containers",
                "level": "Intermediário",
                "resume": "Formado em Ciência da Computação, +7 anos de experiência em desenvolvimento de software, atualmente Engenheiro de Software / DevOps na Meltwater.",
                "room": "1",
                "title": "Kubernetes - Subindo um cluster \"no braço\" na AWS"
            },
            {
                "abstract": "A plataforma mundial de Clouds Públicas e Privadas. Vamos discutir um pouco da história ao longo dos 7 anos da plataforma OpenStack, que é atualmente um dos maiores projetos colaborativos do mundo. Entenda um pouco sobre o cenário mundial e brasileiro na utilização de nuvens com OpenStack e porque ele pode apoiar as empresas na caminhada para inovação, redução de custos e excelência operacional.",
                "author": "Marcelo Dieder",
                "keywords": "",
                "level": "Principiante",
                "resume": "Marcelo trabalha com OpenStack desde 2011 e desde 2013 é embaixador do OpenStack na América Latina, ajudando na disseminação da plataforma. Também é coordenador de Segurança Tecnológica na Getnet, trabalhando com sistemas de alta criticidade, sistemas em clouds e devSecOps.",
                "room": "2",
                "title": "Os 7 anos do OpenStack"
            },
            {
                "abstract": "A Internet das Coisas promete revolucionar todas as áreas da vida, mas ao mesmo tempo, apresenta diversos desafios técnicos. Talvez o maior destes seja a segurança, uma vez que diariamente aparecem novos relatos de ataques envolvendo dispositivos IOT. Como então desenvolver software mais seguro para dispositivos IoT? Por que devemos utilizar autenticação segura entre dispositivos e servidores, como podemos proceder para nós proteger de ataques tanto remotos como locais, e quais as técnicas tecnologias que podem nós auxiliar nisso?",
                "author": "Sean Michael Wykes",
                "keywords": "segurança, desenvolvimento, ",
                "level": "Intermediário",
                "resume": "Britânico, Sean Michael Wykes é mestre em Engenharia de Informação pela Universidade de Southampton. Radicado no Brasil, ele possui mais de 20 anos de experiência prática em design e desenvolvimento de projetos de software e sistemas seguros, com base em tecnologias como cartões inteligentes e elementos seguros. É CTO da empresa brasileira Nascent Secure Technologies, onde se dedica à aplicação prática das tecnologias de criptografia, consultoria especializada, treinamentos e workshops teórico-práticos, além de mentoria tecnológica de equipes no Brasil e no exterior. Ele é autor do livro \"Criptografia Essencial - A Jornada do Criptógrafo\" pela Editora Elsevier, 2016.",
                "room": "3",
                "title": "Elementos para um IoT mais seguro"
            },
            {
                "abstract": "O objetivo da  palestra é mostrar o processamento de imagens e visão computacional utilizando a biblioteca Python OpenCv.",
                "author": "Cássio Antoniazzi",
                "keywords": "imagem, vídeo, python",
                "level": "Intermediário",
                "resume": "Técnico Eletrônica, Pós-Técnico em Automação e Controle de Processos e um pouco engenheiro. Mas que posteriormente conheceu o mundo do desenvolvimento web e migrou totalmente.",
                "room": "4",
                "title": "Processamento de Imagem e Visão Computacional com Python"
            },
            {
                "abstract": "A palestra visa apresentar os principais objetivos de Microempreendedores Individuais e técnicas de como alcançá-los através de um Plano de Presença Digital.",
                "author": "Eduardo Mozart de Oliveira",
                "keywords": "Plano de Presença Digital, Facebook, Google AdWords",
                "level": "Principiante",
                "resume": "Sócio da Net House Informática. Cursando Gestão da Tecnologia da Informação na IERGS e Técnico em Informática pela IENH. Cursos de extensão realizados na área: Gestão Estratégica de Vendas (SEBRAE), Internet: Aplicações Na Medida (SEBRAE), Como Vender Online e Faturar Mais (IBB), Redes Sociais para Vender Mais (IBB).",
                "room": "5",
                "title": "Plano de Presença Digital"
            },
            {
                "abstract": "Durante os últimos meses trabalhei na construção de um ambiente de desenvolvimento para garantir entregas com maior agilidade dos projetos que desenvolvo com WordPress. Vou compartilhar essa experiência de como o projeto evoluiu, qual o estado atual dele e como outros desenvolvedores pode colaborar com o projeto. ",
                "author": "Eduardo Pittol",
                "keywords": "wordpress, web, cms, desenvolvimento, docker, frontend, deploy",
                "level": "Avançado",
                "resume": "Cientista da Computação formado pela Unisinos. Desenvolvolvedor web há 9 anos e a 7 trabalhando com WordPress. Apaixonado pela cultura open source. Ativo em comunidades de empreendedorismo e de tecnologia do RS. Cara da tecnologia da Aztec Online Solutions. Empresa focada em soluções para WordPress. Facilitador do Startup Weekend. Um dos idealizadores do Taquari Valley, uma comunidade que fomenta o empreendedorismo no Vale do Taquari, Rio Grande do Sul. Talk is cheap, show me the code.",
                "room": "6",
                "title": "Desenvolvendo WordPress com Docker, Webpack e Deployer"
            }
        ],
        "15:00": [
            {
                "abstract": "",
                "author": "",
                "keywords": "intervalo",
                "level": "",
                "resume": "",
                "room": "",
                "title": "Coffe-break"
            }
        ],
        "15:30": [
            {
                "abstract": "O ciclo de desenvolvimento de uma aplicação, sistema ou até mesmo site possuí diversos passos, e tradicionalmente o caminho percorrido é demora, complexo e muitas vezes com erros. Nesta apresentação quero mostrar como é possível facilitar a transição de um aplicação desde o seu estágio de desenvolvimento até produção tudo isso utilizado apenas o Docker ;)",
                "author": "Cristiano dos Santos Diedrich",
                "keywords": "Docker Compose, Docker Swarm, Docker Deploy, DevOps",
                "level": "Intermediário",
                "resume": "Formado em sistemas de informação, trabalho atualmente como container specialyst na Umbler, uma startup de hosting sob demanda, atuo na pesquisa e desenvolvimento de soluções para hosting e PaaS. Sou apaixonado por linux e tecnologias open-source, áreas que conheço a mais de 12 anos.",
                "room": "1",
                "title": "Do Compose ao Swarm"
            },
            {
                "abstract": "Ansible É uma ferramenta de automatização de tarefas semelhante a Puppet e Chef , radicalmente simples ",
                "author": "Daniel Lara",
                "keywords": "Linux, Ansible , Automação",
                "level": "Principiante",
                "resume": "Sysadmin ,usário de GNU/Linux a 13 anos, Embaixador do Projeto Fedora no Brasil, Coordenador do time de tradução do pt_BR do fedora, Empacotador do Fedora, Faz parte da Equipe de moderadores do Viva o Linux, e tem vida social",
                "room": "2",
                "title": "Introdução ao Ansible "
            },
            {
                "abstract": "A palestra se propõe a discutir sobre os ataques acontecidos no ano e também trazer à tona o que uma equipe de SI pode fazer para manter as informações protegidas. ",
                "author": "Elvis da Silva Steinbach",
                "keywords": "Seguranca da Informação, Ciberataques, SI",
                "level": "Principiante",
                "resume": "Tenho formação Técnica em Informática, Superior em Análise e Desenvolvimento de Sistemas, já palestrei em diversos eventos tais como: FliSol Poa - Pre-Fisl - Seminário Gaúcho de TI - Congresso Online de TI. Pertenço ao Grupo Elite Linux que discute temas relacionados à Linux e SI e já trabalhei com redes, programação e na manutenção de servidores Linux. Sou autor do livro WhiteHat Linux que deve sair pelos próximos meses e atualmente atuo Coordenador de Ensino de uma escola de informática e faço pesquisa na área de segurança da informação. ",
                "room": "3",
                "title": "Ciberataques 2017 (Falhas e Soluções)"
            },
            {
                "abstract": "Garantir a qualidade de uma API pode não ser algo trivial. Testes comportamentais podem auxiliar nisso, mas nem sempre são facilmente implementáveis. Agora imagine poder utilizar uma linguagem de alto nível, próxima a natural, em Português, para poder realizar estes testes? Isso tudo utilizando ferramentas open source? Nesta palestra vamos abordar como utilizamos o Behave para testar uma API Rest, trazendo os pontos positivos, dificuldades encontradas e as soluções adotadas.",
                "author": "Yuri Zamboni Pinheiro, Alex Garzão",
                "keywords": "testes, automatizados, api",
                "level": "Avançado",
                "resume": "Alex - Sou apaixonado pela área de desenvolvimento de software. Atuei com o projeto e desenvolvimento de várias soluções inovadoras, indo de simples aplicações para desktop até complexas e grandes soluções que lidam com milhares de dados e usuários todos os dias. Curto áreas como compiladores, geradores de código, testes, máquinas virtuais, linguagens de programação, entre outras. Atuei em empresas como ATAR, GetWay e TERRA. Atualmente estou no ZAP Imóveis como Arquiteto de Software. <br/> Yuri - Por um mundo com mais automação de testes. Entusiasta de automação de testes, em busca de melhoria contínua de processos para garantir a qualidade das entregas. Já atuei com testes funcionais manuais, e nos últimos anos venho buscando criar soluções de testes automatizados. Já utilizei .Net, Selenium, Gherking no formato BDD, PostMan, Python, Behave e SpecFlow. Atualmente estou no ZAP Imóveis como Analista de Testes.",
                "room": "4",
                "title": "Garantindo a qualidade da sua API REST com Behave"
            },
            {
                "abstract": "Falar sobre as diversas maneiras que podemos utilizar o arduino para transformar qualquer coisa em internet das coisas.",
                "author": "William Soares meier",
                "keywords": "Arduino, IoT, automacao",
                "level": "Principiante",
                "resume": "Formado em eletrônica e um dos fundadores dá easybox e o fundador dá monitoraquarium.",
                "room": "5",
                "title": "IoT com arduino"
            },
            {
                "abstract": "A história do Tchelinux remonta aos últimos anos da década de 90 quando usuários de Software Livre se reuniam em Porto Alegre para compartilhar CDs com Distribuições Linux e BSDs, programas de computadores, etc no que foi o começo da comunidade gaúcha. Nesta apresentação será abordada a história do Tchelinux e as fases da existência do grupo nos últimos 20 anos e também as perspectivas para os anos vindouros.",
                "author": "Leonardo Vaz",
                "keywords": "Tchelinux, Grupo de Usuários, Software Livre, Comunidade",
                "level": "Principiante",
                "resume": "Leonardo Vaz teve seu primeiro contato com Linux em 1998 e vem rodando ele em todos seus computadores desde então. Depois de ter trabalhado por mais de 5 anos com sistemas de arquivos locais e distribuídos na equipe de Engenharia de Suporte da Red Hat, atualmente desempenha o papel de Gerente de Comunidade do Ceph, onde é responsável por interface entre comunidade e desenvolvedores.",
                "room": "6",
                "title": "Tchelinux: Passado, Presente e Futuro"
            }
        ],
        "16:30": [
            {
                "abstract": "",
                "author": "Leonardo Vaz",
                "keywords": "encerramento",
                "level": "",
                "resume": "",
                "room": "",
                "title": "Encerramento"
            }
        ]
    },
    "sponsors": [],
    "support": [
        {
            "logo": "logo_pytche.png",
            "long_name": "Py[Tchê]",
            "short_name": "Py[Tchê]",
            "url": " https://www.meetup.com/preview/PyTche"
        },
        {
            "logo": "PHPRS.png",
            "long_name": "PHP-RS",
            "short_name": "PHP-RS",
            "url": "http://www.phprs.com.br"
        },
        {
            "logo": "doseextra.jpg",
            "long_name": "Dose Extra Multimídia",
            "short_name": "Dose Extra",
            "url": " https://doseextra.com"
        }
    ]
}
